================================================================================
Triple slash style - single tag
================================================================================

/// @param {String} $name

---

(document
  (tag
    (tag_param
      (type
        (type_name))
      (variable_name))))

================================================================================
Triple slash style - multiple tags
================================================================================

/// @param {String} $a
/// @param {Number} $b

---

(document
  (tag
    (tag_param
      (type
        (type_name))
      (variable_name)))
  (tag
    (tag_param
      (type
        (type_name))
      (variable_name))))

================================================================================
Triple slash style - description and tags
================================================================================

/// This is a description
/// @param {String} $name
/// @return {Number}

---

(document
  (description)
  (tag
    (tag_param
      (type
        (type_name))
      (variable_name)))
  (tag
    (tag_return
      (type
        (type_name)))))

================================================================================
Triple slash style - example with single-line comment
================================================================================

/// @example scss - Test
///   .test {
///     $result: sum(2, 3); // inline comment
///     content: $result;
///   }
/// @return {number}

---

(document
  (tag
    (tag_example
      (example_language)
      (tag_description
        (line_description))
      (code_block
        (code_line)
        (code_line)
        (code_line)
        (code_line))))
  (tag
    (tag_return
      (type
        (type_name)))))
